<?php
/****************************************************************************************************
<<処理名>>
文字列操作支援クラス
<<更新履歴>>
新規作成	v1.0	2012年11月27日	阿部　誠	カードの支払日だな...
/****************************************************************************************************/
require_once('./setup.php');
/* 処理開始ログ出力 */
$LogObj->log('>>> fncString Started --------------------', PEAR_LOG_INFO );

	// 文字列変換関数
	function strconv($myStr,$output)
	{ 
		if ($output!="e"){ 
			return mb_convert_encoding($myStr ,"UTF-8","EUC-JP");   //右から左へ変換 
		}else{ 
			return mb_convert_encoding($myStr ,"EUC-JP","UTF-8");   //右から左へ変換 
		} 
	} 

	function is_mailaddr( $mailaddress )
	{
		if(preg_match('/^(?:[^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff]+(?![^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff])|"[^\\\\\x80-\xff\n\015"]*(?:\\\\[^\x80-\xff][^\\\\\x80-\xff\n\015"]*)*")(?:\.(?:[^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff]+(?![^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff])|"[^\\\\\x80-\xff\n\015"]*(?:\\\\[^\x80-\xff][^\\\\\x80-\xff\n\015"]*)*"))*@(?:[^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff]+(?![^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff])|\[(?:[^\\\\\x80-\xff\n\015\[\]]|\\\\[^\x80-\xff])*\])(?:\.(?:[^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff]+(?![^(\040)<>@,;:".\\\\\[\]\000-\037\x80-\xff])|\[(?:[^\\\\\x80-\xff\n\015\[\]]|\\\\[^\x80-\xff])*\]))*$/', $mailaddress)) return true;
	
	}

/* 処理終了ログ */
$LogObj->log("<<< fncString Ended --------------------", PEAR_LOG_INFO );
?> 